<template>
    <div class="hospital_main-container">
        <div class="hospital_main-logo">
            <img src="@/assets/logo.png" alt="">
        </div>
        <div class="hospital_main-box">
            <div class="hospital_main-item hospital_main-vr" @mouseenter="handleEnter($event)" @mouseleave="handleLeave($event)" @click="$router.push('/vr')">
                <transition name="text">
                    <span v-if="showText">医院导览</span>
                </transition>
                <transition name="icon">
                    <svg v-if="showIcon" t="1679537656522" viewBox="0 0 1251 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2883" width="32" height="32">
                        <path d="M1224.248889 392.248889h0.284444-0.284444M1206.897778 327.395556a44.088889 44.088889 0 0 0-28.444445 10.24l-168.106666 140.231111a44.373333 44.373333 0 0 0 0 68.266666l168.391111 140.231111a44.373333 44.373333 0 0 0 72.817778-34.133333v-280.462222a44.373333 44.373333 0 0 0-44.657778-44.373333zM901.973333 0H113.777778a113.777778 113.777778 0 0 0-113.777778 113.777778v796.444444a113.777778 113.777778 0 0 0 113.777778 113.777778h788.195555a113.777778 113.777778 0 0 0 113.777778-113.777778V113.777778a113.777778 113.777778 0 0 0-113.777778-113.777778z m-66.56 756.906667h-77.084444l-85.333333-203.377778H568.888889v203.377778h-83.911111L178.062222 267.093333h85.333334l234.097777 375.751111V267.093333H568.888889v8.533334h129.991111a138.808889 138.808889 0 0 1 48.355556 268.8zM568.888889 346.737778h129.991111a67.982222 67.982222 0 1 1 0 135.68H568.888889z" p-id="2884"></path>
                    </svg>
                </transition>
            </div>
            <div class="hospital_main-item hospital_main-case" @mouseenter="handleEnter($event)" @mouseleave="handleLeave($event)" @click="$router.push('/home/case_list')">
                <transition name="text">
                    <span v-if="showText">病例管理</span>
                </transition>
                <transition name="icon">
                    <svg v-if="showIcon" t="1679540698373" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4430" width="32" height="32"><path d="M599.48 392.46c-6.06 6.4-5.78 16.5 0.62 22.56 6.4 6.06 16.5 5.78 22.56-0.62 6.06-6.4 5.78-16.5-0.62-22.56-6.4-6.06-16.5-5.78-22.56 0.62z" p-id="4431"></path><path d="M959.5 655.14c-2.1-76.29-33.78-147.2-89.21-199.67L548.77 151.14c-55.43-52.46-127.97-80.2-204.26-78.11-76.29 2.1-147.2 33.78-199.67 89.2l-2.23 2.36C90.14 220.03 62.4 292.57 64.5 368.86c2.1 76.29 33.78 147.2 89.2 199.67l321.53 304.33c53.48 50.62 122.88 78.22 196.21 78.22 2.68 0 5.36-0.04 8.05-0.11 76.29-2.1 147.2-33.78 199.67-89.2l2.23-2.36c52.47-55.44 80.21-127.98 78.11-204.27zM856.69 836.02l-2.24 2.36c-46.22 48.83-108.69 76.74-175.9 78.58-2.37 0.07-4.73 0.1-7.09 0.1-64.6 0-125.75-24.32-172.85-68.91L348.13 705.72 574.4 466.66c6.46-6.82 6.16-17.59-0.66-24.04-6.82-6.46-17.59-6.16-24.04 0.66L323.42 682.33 177.09 543.82c-48.83-46.22-76.74-108.69-78.58-175.9-1.85-67.21 22.59-131.12 68.81-179.94l2.23-2.36c46.22-48.83 108.69-76.74 175.9-78.58 2.37-0.07 4.73-0.1 7.09-0.1 64.6 0 125.75 24.32 172.85 68.91l146.34 138.51-24.23 25.6c-6.46 6.82-6.16 17.59 0.66 24.04 3.29 3.11 7.49 4.66 11.69 4.66 4.51 0 9.01-1.78 12.35-5.32l24.23-25.6 150.48 142.44c48.83 46.22 76.74 108.69 78.58 175.9 1.85 67.2-22.58 131.11-68.8 179.94z" p-id="4432"></path><path d="M830.01 497.09c-6.76-6.34-18.44-7.21-25.05 0-6.32 6.88-7.22 18.28 0 25.06 5.09 4.77 9.95 9.77 14.53 15.03 1.23 1.41 2.44 2.85 3.63 4.3 0.31 0.37 2.08 2.61 2.39 2.96 1.73 2.27 3.4 4.58 5.02 6.92 7.71 11.12 14.27 23.01 19.73 35.39 0.14 0.38 1.11 2.68 1.18 2.87 0.59 1.5 1.17 3 1.72 4.51a209.1 209.1 0 0 1 3.62 10.67c2.06 6.66 3.79 13.42 5.17 20.26 0.64 3.16 1.16 6.33 1.69 9.5 0.08 0.46 0.13 0.78 0.18 1.02 0.02 0.17 0.04 0.39 0.07 0.65 0.24 2.13 0.49 4.26 0.68 6.4 0.62 6.95 0.86 13.92 0.77 20.89-0.11 9.27 8.23 18.14 17.72 17.72 9.69-0.43 17.6-7.78 17.72-17.72 0.74-62.16-25.41-123.9-70.77-166.43zM207.42 480.52c-0.46-0.57-0.91-1.14-1.36-1.71l-0.79-1.04c-2.51-3.47-5.02-6.92-7.38-10.5-4.42-6.69-8.48-13.62-12.17-20.74-1.97-3.8-3.83-7.65-5.59-11.55-0.08-0.17-1-2.27-1.23-2.77-0.67-1.61-1.31-3.22-1.94-4.85-2.99-7.74-5.56-15.63-7.72-23.64s-3.9-16.13-5.21-24.32c-0.09-0.59-0.72-5.29-0.64-4.47-0.14-1.18-0.28-2.36-0.41-3.55-0.44-4.26-0.77-8.52-0.97-12.8-0.39-8.01-0.36-16.04 0.1-24.05 0.24-4.27 0.61-8.53 1.1-12.78 0.07-0.61 0.15-1.21 0.22-1.82 0.04-0.23 0.1-0.69 0.21-1.42 0.36-2.11 0.68-4.23 1.06-6.33 1.63-9.09-2.46-19.54-12.37-21.79-8.65-1.97-20.05 2.62-21.79 12.37-10.22 57.11-0.56 116.49 27.61 167.3 8 14.43 17.64 27.88 28.31 40.45 6.02 7.09 18.94 6.66 25.06 0 6.93-7.55 6.42-17.49 0-25.05a243.91 243.91 0 0 1-4.1-4.94zM237.76 522.07c-9.27 0-18.15 8.15-17.72 17.72 0.43 9.6 7.78 17.72 17.72 17.72 9.27 0 18.15-8.15 17.72-17.72-0.43-9.6-7.79-17.72-17.72-17.72z" p-id="4433"></path>
                    </svg>
                </transition>
            </div>
            <div class="hospital_main-item hospital_main-role" @mouseenter="handleEnter($event)" @mouseleave="handleLeave($event)" @click="$router.push('/home/role')">
                <transition name="text">
                    <span v-if="showText">角色扮演</span>
                </transition>
                <transition name="icon">
                    <svg v-if="showIcon" t="1679540811862" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="6337" width="32" height="32"><path d="M268.2 366.2c78.2 0 141.8-63.6 141.8-141.8 0-78.2-63.6-141.8-141.8-141.8-78.2 0-141.8 63.6-141.8 141.8 0 78.1 63.6 141.8 141.8 141.8z m0-213.7c39.6 0 71.8 32.2 71.8 71.8s-32.2 71.8-71.8 71.8-71.8-32.2-71.8-71.8 32.2-71.8 71.8-71.8zM402.6 396.5H133.9c-25.9 0-47 21.1-47 47v349.9c0 25.9 21.1 47 47 47h104.6v69.4c0 19.3 15.7 35 35 35s35-15.7 35-35v-69.4h94c25.9 0 47-21.1 47-47V443.5c0.1-26-21-47-46.9-47z m-23 373.9H156.9V466.5h222.6v303.9zM708.3 475.4H583.2V204h117.7c19.3 0 35-15.7 35-35s-15.7-35-35-35h-171c-9.2 0-16.7 7.5-16.7 16.7v735.7c0 9.2 7.5 16.7 16.7 16.7h178.4c19.3 0 35-15.7 35-35s-15.7-35-35-35H583.2V545.4h125.1c19.3 0 35-15.7 35-35s-15.7-35-35-35z" p-id="6338"></path><path d="M844.9 169m-55.7 0a55.7 55.7 0 1 0 111.4 0 55.7 55.7 0 1 0-111.4 0Z" p-id="6339"></path><path d="M844.9 513.9m-55.7 0a55.7 55.7 0 1 0 111.4 0 55.7 55.7 0 1 0-111.4 0Z" p-id="6340"></path><path d="M844.9 858.8m-55.7 0a55.7 55.7 0 1 0 111.4 0 55.7 55.7 0 1 0-111.4 0Z" p-id="6341"></path>
                    </svg>
                </transition>
            </div>
            <div class="hospital_main-item hospital_main-test" @mouseenter="handleEnter($event)" @mouseleave="handleLeave($event)" @click="$router.push('/home/test')">
                <transition name="text">
                    <span v-if="showText">测试功能</span>
                </transition>
                <transition name="icon">
                    <svg v-if="showIcon" t="1679540870405" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="7369" width="32" height="32"><path d="M538.46016 714.0352h215.79776c18.88256 0 35.06688 16.18432 35.06688 35.06688s-16.18432 37.77024-35.06688 37.77024h-215.79776c-18.88256 0-35.06688-16.18432-35.06688-35.06688 0-18.8928 16.1792-37.77024 35.06688-37.77024zM548.09088 418.47296h215.79776c18.88256 0 35.072 16.18432 35.072 35.06688s-16.18944 35.072-35.072 35.072h-215.79776c-18.88256 0-35.06176-16.18944-35.06176-35.072s16.1792-35.06688 35.06176-35.06688zM237.88032 423.86944c5.39648-5.39648 16.18432-5.39648 24.27904 0l59.34592 59.34592 129.47968-129.47968c8.0896-8.09472 21.57568-8.09472 26.97728 0 8.0896 8.09472 8.0896 18.88256 0 26.97216l-140.26752 140.26752c-5.39648 2.70336-10.78784 5.39648-16.18432 5.39648s-8.09472-2.688-10.78784-5.39648l-70.144-70.12864c-10.78784-10.79296-10.78784-21.58592-2.69824-26.97728zM434.79552 806.90688c-8.0896 8.09984-21.57568 8.09984-26.97728 0l-56.64256-56.64256-56.64768 56.64256c-8.09472 8.09984-21.5808 8.09984-26.97728 0-8.0896-8.0896-8.0896-21.57568 0-26.97216l56.64768-56.64768-56.64768-56.64256c-8.0896-8.0896-8.0896-21.57568 0-26.97216 8.09472-8.09472 18.88256-8.09472 26.97728 0l56.64768 56.64256 56.64256-56.64256c8.09472-8.09472 21.5808-8.09472 26.97728 0 8.09472 8.0896 8.09472 18.88256 0 26.97216l-56.64256 56.64256 56.64256 56.64768c8.09472 5.39648 8.09472 18.88256 0 26.97216z" p-id="7370"></path><path d="M833.24928 148.52608H767.6928a106.4448 106.4448 0 0 1 2.11968 20.89472v32.9472h63.4368c17.81248 0 32.3072 14.4896 32.3072 32.30208v671.98976c0 17.81248-14.4896 32.3072-32.3072 32.3072H204.25728a32.34304 32.34304 0 0 1-32.3072-32.3072V234.66496a32.33792 32.33792 0 0 1 32.3072-32.30208h63.4368V169.4208c0-7.15776 0.77824-14.12608 2.1248-20.89472H204.25728c-47.58016 0-86.13888 38.56896-86.13888 86.13888v671.98976c0 47.58016 38.55872 86.13888 86.13888 86.13888h628.99712c47.56992 0 86.13888-38.55872 86.13888-86.13888V234.66496c-0.00512-47.56992-38.57408-86.13888-86.144-86.13888z" p-id="7371"></path><path d="M663.0656 134.35392h-37.76c0-59.3408-48.55808-107.89888-107.89888-107.89888-59.34592 0-107.89376 48.55296-107.89376 107.89888h-35.072c-18.88256 0-35.072 16.18944-35.072 35.06688v37.76512l358.76352-2.69824V169.4208c0-18.88256-16.18944-35.06688-35.06688-35.06688z m-78.72 30.0288l-133.87264 1.00352V134.3488c0-36.91008 30.02368-66.93888 66.93376-66.93888s66.93888 30.0288 66.93888 66.93888v30.03392z" p-id="7372"></path>
                    </svg>
                </transition>
            </div>
        </div>
    </div>
</template>

<script>
import Hexagon from '@/component/Hexagon.vue';
    export default {
        name: "Main",
        components: {
            Hexagon
        },
        data() {
            return {
                showText: true,
                showIcon: false
            }
        },
        methods: {
            handleEnter(e) {
                this.showText = false;
                this.showIcon = true;
            },
            handleLeave(e) {
                this.showText = true;
                this.showIcon = false;
            }
        }
    }
</script>

<style lang="less" scoped>
.hospital_main-container {
    height: calc(100vh - 60px);
    padding-top: 60px;
    background-image: url("@/assets/main/mainBackground.jpg");
    background-position: center center;
    background-repeat: no-repeat;
    background-size: cover;
    .hospital_main-logo {
        backdrop-filter: blur(8px);
        padding: 10px;
        box-sizing: border-box;
        img {
            display: block;
            margin: 0px auto;
            width: 220px;
            height: auto;
        }
        .hospital_main-title {
            text-align: center;
            font-size: 30px;
            font-weight: 600;
            margin-top: 10px;
            // background: -webkit-linear-gradient(315deg,#42d392 25%,#647eff);
            // background-clip: text;
            // -webkit-text-fill-color: transparent;
        }
        
    }
    .hospital_main-box {
        
        width: 100%;
        display: flex;
        flex-wrap: nowrap;
        justify-content: space-around;
        position: absolute;
        top: 60%;

        .hospital_main-item {
            backdrop-filter: blur(8px);
            height: 150px;
            width: 150px;
            border-radius: 100%;
            background: transparent;
            border: 2px solid #fff;
            cursor: pointer;
            display: flex;
            justify-content: center;
            align-items: center;
            position: relative;
            &::before {
                height: 150px;
                width: 150px;
                position: absolute;
                content: '';
                display: inline-block;
                border-radius: 150px;
                box-shadow: 0 0 15px #fff;
                animation: pulse 1s linear infinite;
                animation-delay: 0s !important;
            }

            &::after {
                height: 150px;
                width: 150px;
                position: absolute;
                content: '';
                display: inline-block;
                border-radius: 150px;
                box-shadow: 0 0 12px #fff;
                animation: pulse 1s linear infinite;
                animation-delay: .5s !important;
            }
            span {
                font-size: 22px;
                font-weight: 600;
            }

            svg {
                position: absolute;
                width: 60px;
                height: 60px;
            }
        }
    }
}

.text-enter-active,.text-leave-active {
    transition: all 0.5s ease;
}

.text-enter,.text-leave-to {
    transform: translate(50px);
    opacity: 0;
    
}

.icon-enter-active,.icon-leave-active {
    transition: all 0.5s ease;
}

.icon-enter,.icon-leave-to {
    transform: translate(-50px);
    opacity: 0;
    
}
@keyframes pulse {
    0% {
        width: 150px;
        height: 150px;
        opacity: 0;
    }
    50% {
        width: 200px;
        height: 200px;
        opacity: 1;
    }
    100% {
        width: 250px;
        height: 250px;
        opacity: 0;
    }
}
</style>