export const roles = {
    "yizhu":{
        "静脉注射": [
            {
                title: "准备工作",
                desc: ["需要准备对应的清洁工具、消毒剂、止血带、静脉注射器、药品等"],
                image: require("@/assets/role/roleDetail/术前准备工作.jpg"),
                video: require("@/assets/role/roleDetail/静脉注射.mp4")
            },
            {
                title: '选择注射部位',
                desc: [
                    '选择合适的静脉注射部位',
                    '在宠物前肢或后肢上选择静脉注射部位，常用的部位有腹内静脉、耳静脉和颈静脉等。'
                ],
                image: require("@/assets/role/roleDetail/选取注射部位.jpg")
            },
            {
                title: '穿刺',
                desc: [
                    "首先清洁注射部位，用酒精或其他消毒剂清洁注射部位，保持干燥。",
                    "接着使用止血带，具体操作是用止血带包扎在宠物的肢体上，让静脉更明显，便于注射。",
                    "穿刺：用注射器的针头穿刺静脉，确定针头已经进入了静脉内。",
                    "穿刺：用注射器的针头穿刺静脉，确定针头已经进入了静脉内。"
                ],
                image: require("@/assets/role/roleDetail/穿刺.jpg")
            },
            {
                title: "注药且观察反应",
                desc: [
                    '注药：缓慢地推动注射器活塞，让药物缓慢注入静脉内。',
                    '拆卸止血带：在确认药物已经注射完成后，拆卸止血带，轻轻拔出针头，注意止血。',
                    '观察：注射药物后，观察宠物是否有不良反应，如出现呼吸困难、过敏反应等，应及时处理。'
                ],
                image: require("@/assets/role/roleDetail/注射药物.jpg")
            }
        ],
        "皮下注射": [
            {
                title: "选取注射部位",
                desc: [
                    "选择合适的皮下注射部位：",
                    "常见的皮下注射部位有颈部、背部和侧腹部等，选择部位应避免骨头、神经和血管等。"
                ],
                image: require("@/assets/role/roleDetail/选取注射部位.jpg"),
                video: require("@/assets/role/roleDetail/皮下注射.mp4")
            },
            {
                title: "穿刺",
                desc: [
                    '清洁注射部位：用酒精或其他消毒剂清洁注射部位，保持干燥。',
                    '抓皮：用手指捏起注射部位的皮肤，使之隆起。',
                    '穿刺：将注射器的针头垂直于皮肤，刺入隆起的皮肤中，然后慢慢地推入注射器活塞。'
                ],
                image: require("@/assets/role/roleDetail/穿刺.jpg")
            },
            {
                title: "注药拔针",
                desc: [
                    "注药：缓慢地推动注射器活塞，让药物缓慢注入皮下组织。",
                    "拔针：注射完成后，轻轻拔出注射器的针头，用消毒棉球按压注射部位，防止药液渗出。",
                    "观察：注射药物后，观察宠物是否有不良反应，如出现呼吸困难、过敏反应等，应及时处理。"
                ],
                image: require("@/assets/role/roleDetail/注射药物.jpg")
            }
        ],
        "肌肉注射": [
            {
                title: "选取注射部位",
                desc: [
                    "选择合适的注射部位：常见的肌肉注射部位有臀部、前肢、后肢等，选择部位应避免骨头、神经和血管等。",
                    "清洁注射部位：用酒精或其他消毒剂清洁注射部位，保持干燥。"
                ],
                image: require("@/assets/role/roleDetail/选取注射部位.jpg"),
                video: require("@/assets/role/roleDetail/肌肉注射.mp4")
            },
            {
                title: "穿刺",
                desc: [
                    "抓皮：用手指捏起注射部位的皮肤，使之隆起。",
                    "穿刺：将注射器的针头垂直于皮肤，刺入隆起的皮肤中，然后慢慢地推入注射器活塞。",
                    "检查针头是否进入肌肉：向注射器内注入一些药液，如果药液能够轻松地被肌肉吸收，说明针头进入了肌肉，否则需要重新穿刺。"
                ],
                image: require("@/assets/role/roleDetail/穿刺.jpg")
            },
            {
                title: "注药拔针",
                desc: [
                    "注药：缓慢地推动注射器活塞，让药物缓慢注入肌肉组织。",
                    "拔针：注射完成后，轻轻拔出注射器的针头，用消毒棉球按压注射部位，防止药液渗出。",
                    "观察：注射药物后，观察宠物是否有不良反应，如出现呼吸困难、过敏反应等，应及时处理。"
                ],
                image: require("@/assets/role/roleDetail/注射药物.jpg")
            }
        ],
        "术前麻醉": [
            {
                title: "麻醉准备",
                desc: [
                    "检查宠物：在进行术前麻醉之前，需要对宠物进行全面检查，确保宠物身体健康，没有任何慢性疾病或急性症状。",
                    "禁食：在手术前一定时间内，要让宠物禁食，以避免手术中呕吐或误吸等情况的发生。具体的禁食时间要根据宠物的品种和年龄而定，一般为8-12小时。"
                ],
                image: require("@/assets/role/roleDetail/麻醉准备.jpg"),
                video: require("@/assets/role/roleDetail/宠物麻醉.mp4")
            },
            {
                title: "开始麻醉",
                desc: [
                    "选择麻醉药物：根据手术的类型、宠物的体重和健康状况等因素，选择适合的麻醉药物。一般来说，全身麻醉可以采用静脉麻醉或气管插管麻醉，局部麻醉可以采用局部麻醉剂。",
                    "给药：根据宠物的体重和需要麻醉的深度，按照医生的建议给药。全身麻醉需要将麻醉剂注射到静脉中或通过气管插管进行吸入，局部麻醉需要将麻醉剂注射到局部组织中。"
                ],
                image: require("@/assets/role/roleDetail/开始麻醉.jpg")
            },
            {
                title: "麻醉监测完善",
                desc: [
                    "监测：在麻醉过程中，需要对宠物进行监测，包括心率、呼吸、血压等指标的监测，以及对宠物的体温和麻醉深度进行监测。一旦发现异常情况，需要及时采取措施。",
                    "麻醉苏醒：手术结束后，需要对宠物进行观察和护理，直到宠物完全恢复清醒。在此期间，需要注意宠物的体温、呼吸、心率等指标的变化，以及宠物的饮食和排泄情况。"
                ],
                image: require("@/assets/role/roleDetail/麻醉监测.jpg")
            }
        ],
        "器械准备": [
            {
                title: "器械清洗消毒",
                desc: [
                    "在进行手术和检查之前，需要准备各种器械，例如手术刀、缝合针、手术灯等。",
                    "这些器械需要经过清洗和消毒，以确保宠物不会感染。"
                ],
                image: require("@/assets/role/roleDetail/器械清洗消毒.jpg"),
                video: require("@/assets/role/roleDetail/器械准备.mp4")
            },
            {
                title: "器械检查",
                desc: [
                    "安排器械：在医院的手术室中，需要将各种器械按照需要进行安排和准备，例如放置手术刀、缝合针、止血夹等。",
                    "检查器械的完整性：在进行手术之前，需要检查各种器械的完整性和清洁度，确保它们没有损坏或受到污染。"
                ],
                image: require("@/assets/role/roleDetail/器械检查.jpg")
            },
            {
                title: "器械的后续维护",
                desc: [
                    "标记和分类器械：对于不同类型的手术和检查，需要标记和分类器械，以便医生和护士可以快速找到需要的器械。",
                    "定期检查器械：为确保器械在长时间使用后仍然能够正常工作，医院需要定期检查器械的状态，包括刀片的锋利度、电动设备的电池寿命等等。",
                    "记录器械的使用和维护情况：为了保证医院各种器械的正常运作和安全性，需要记录每一件器械的使用和维护情况"
                ],
                image: require("@/assets/role/roleDetail/器械的后续维护.jpg")

            }
        ]
    },
    "shouyi": {
        "手术衣穿戴":[
            {
                title: "洗手消毒",
                desc: [
                    "手术前进行洗手消毒：在穿戴手术衣之前，需要进行洗手消毒，以避免手部的污染。"
                ],
                image: require("@/assets/role/roleDetail/手术前消毒.jpg"),
                video: require("@/assets/role/roleDetail/手术衣穿戴.mp4")
            },
            {
                title: "穿戴手术服装",
                desc: [
                    "穿戴手术帽：戴上手术帽，以避免头发和皮肤碎屑污染手术环境。",
                    "穿戴口罩：在穿戴手术衣之前，需要戴上口罩，以避免呼出的细菌或病毒污染手术环境。",
                    "穿戴手术衣：将手术衣打开并穿上，确保手术衣的袖子紧贴肌肤并牢固固定，以避免污染手术环境。",
                    "穿戴手术手套：戴上手术手套，以保护手部和手术环境的清洁。"
                ],
                image: require("@/assets/role/roleDetail/穿戴手术衣.jpg")
            },
        ],
        "宠物手术": [
            {
                title: "术前准备",
                desc: [
                    "麻醉：给宠物注射麻醉剂或全身麻醉，使其失去意识和感觉。",
                    "固定体位：将宠物固定在手术台上，以便进行手术操作。",
                    "消毒：将手术部位进行彻底的消毒，以杀死病菌，减少感染的风险。"
                ],
                image: require("@/assets/role/roleDetail/术前准备.jpg"),
                video: require("@/assets/role/roleDetail/宠物手术.mp4")
            },
            {
                title: "手术进行时",
                desc: [
                    "开刀：用手术刀或剪刀进行手术切口，以进入需要操作的部位。",
                    "手术操作：进行手术操作，包括切除病变组织、缝合切口等。",
                    "监测：在手术过程中，兽医会对宠物的呼吸、心率、体温等生命体征进行监测，确保宠物处于安全状态。"
                ],
                image: require("@/assets/role/roleDetail/手术进行时.jpg")
            },
            {
                title: "术后完善工作",
                desc: [
                    "清洗缝合：在手术结束后，将手术部位进行清洗和消毒，然后缝合切口。",
                    "麻醉清醒：在手术结束后，等待宠物从麻醉中醒来，然后将其转移到恢复区进行观察。",
                    "给药和护理：在手术后，根据需要为宠物给予药物治疗，并提供必要的护理，以促进宠物的恢复和康复。"
                ],
                image: require("@/assets/role/roleDetail/术后完善.jpg")
            }
        ],
    },
    "qiantai": {
        "挂号收费": [
            {
                title: "接待登记",
                desc: [
                    "接待宠主：宠物医院前台接待宠主，了解宠物情况，并协助宠主进行挂号和收费。",
                    "登记信息：前台工作人员根据宠主提供的宠物信息进行登记，包括宠物姓名、品种、年龄、病史等，同时登记宠主联系方式。",
                    "确认服务项目：根据宠主提供的宠物情况和症状，前台工作人员确认宠物需要的诊疗服务项目。"
                ],
                image: require("@/assets/role/roleDetail/接待登记.jpg"),
                video: require("@/assets/role/roleDetail/挂号收费.mp4")
            },
            {
                title: "收费",
                desc: [
                    "提供收费信息：前台工作人员根据医院的收费标准，提供宠主需要支付的费用信息，包括挂号费、诊疗费、药品费等。",
                    "支付费用：宠主根据前台提供的费用信息进行支付，并获得相关的收据和发票。",
                    "完成收费：宠主完成支付后，前台工作人员将宠物的登记信息和支付记录做好档案记录。"
                ],
                image: require("@/assets/role/roleDetail/收费.jpg")
            },
            {
                title: "安排医生",
                desc: [
                    "分配医生：宠主支付费用后，前台工作人员将宠主信息和服务项目分配给相应的医生进行后续诊疗。",
                    "安排就诊时间：前台工作人员根据宠主的需求和医生的安排，为宠物安排就诊时间，做好记录。",
                    "提供咨询：在收费过程中，宠主有任何疑问，前台工作人员可以提供相应的咨询服务。"
                ],
                image: require("@/assets/role/roleDetail/安排医生.jpg")
            }
        ]
    }
}