export const roles = {
    "yizhu":{
        "静脉注射": [
            {
                title: "准备工作",
                desc: ["需要准备对应的清洁工具、消毒剂、止血带、静脉注射器、药品等"],
                image: require("@/assets/role/roleDetail/术前准备工作.jpg"),
                video: require("@/assets/role/roleDetail/静脉注射.mp4")
            },
            {
                title: '选择注射部位',
                desc: [
                    '选择合适的静脉注射部位',
                    '在宠物前肢或后肢上选择静脉注射部位，常用的部位有腹内静脉、耳静脉和颈静脉等。'
                ],
                image: require("@/assets/role/roleDetail/选取注射部位.jpg")
            },
            {
                title: '穿刺',
                desc: [
                    "首先清洁注射部位，用酒精或其他消毒剂清洁注射部位，保持干燥。",
                    "接着使用止血带，具体操作是用止血带包扎在宠物的肢体上，让静脉更明显，便于注射。",
                    "穿刺：用注射器的针头穿刺静脉，确定针头已经进入了静脉内。",
                    "穿刺：用注射器的针头穿刺静脉，确定针头已经进入了静脉内。"
                ],
                image: require("@/assets/role/roleDetail/穿刺.jpg")
            },
            {
                title: "注药且观察反应",
                desc: [
                    '注药：缓慢地推动注射器活塞，让药物缓慢注入静脉内。',
                    '拆卸止血带：在确认药物已经注射完成后，拆卸止血带，轻轻拔出针头，注意止血。',
                    '观察：注射药物后，观察宠物是否有不良反应，如出现呼吸困难、过敏反应等，应及时处理。'
                ],
                image: require("@/assets/role/roleDetail/注射药物.jpg")
            }
        ],
        "皮下注射": [
            {
                title: "选取注射部位",
                desc: [
                    "选择合适的皮下注射部位：",
                    "常见的皮下注射部位有颈部、背部和侧腹部等，选择部位应避免骨头、神经和血管等。"
                ],
                image: require("@/assets/role/roleDetail/选取注射部位.jpg"),
                video: require("@/assets/role/roleDetail/皮下注射.mp4")
            },
            {
                title: "穿刺",
                desc: [
                    '清洁注射部位：用酒精或其他消毒剂清洁注射部位，保持干燥。',
                    '抓皮：用手指捏起注射部位的皮肤，使之隆起。',
                    '穿刺：将注射器的针头垂直于皮肤，刺入隆起的皮肤中，然后慢慢地推入注射器活塞。'
                ],
                image: require("@/assets/role/roleDetail/穿刺.jpg")
            },
            {
                title: "注药拔针",
                desc: [
                    "注药：缓慢地推动注射器活塞，让药物缓慢注入皮下组织。",
                    "拔针：注射完成后，轻轻拔出注射器的针头，用消毒棉球按压注射部位，防止药液渗出。",
                    "观察：注射药物后，观察宠物是否有不良反应，如出现呼吸困难、过敏反应等，应及时处理。"
                ],
                image: require("@/assets/role/roleDetail/注射药物.jpg")
            }
        ],
        "肌肉注射": [
            {
                title: "选取注射部位",
                desc: [
                    "选择合适的注射部位：常见的肌肉注射部位有臀部、前肢、后肢等，选择部位应避免骨头、神经和血管等。",
                    "清洁注射部位：用酒精或其他消毒剂清洁注射部位，保持干燥。"
                ],
                image: require("@/assets/role/roleDetail/选取注射部位.jpg"),
                video: require("@/assets/role/roleDetail/肌肉注射.mp4")
            },
            {
                title: "穿刺",
                desc: [
                    "抓皮：用手指捏起注射部位的皮肤，使之隆起。",
                    "穿刺：将注射器的针头垂直于皮肤，刺入隆起的皮肤中，然后慢慢地推入注射器活塞。",
                    "检查针头是否进入肌肉：向注射器内注入一些药液，如果药液能够轻松地被肌肉吸收，说明针头进入了肌肉，否则需要重新穿刺。"
                ],
                image: require("@/assets/role/roleDetail/穿刺.jpg")
            },
            {
                title: "注药拔针",
                desc: [
                    "注药：缓慢地推动注射器活塞，让药物缓慢注入肌肉组织。",
                    "拔针：注射完成后，轻轻拔出注射器的针头，用消毒棉球按压注射部位，防止药液渗出。",
                    "观察：注射药物后，观察宠物是否有不良反应，如出现呼吸困难、过敏反应等，应及时处理。"
                ],
                image: require("@/assets/role/roleDetail/注射药物.jpg")
            }
        ],
        "术前麻醉": [
            {
                title: "麻醉准备",
                desc: [
                    "检查宠物：在进行术前麻醉之前，需要对宠物进行全面检查，确保宠物身体健康，没有任何慢性疾病或急性症状。",
                    "禁食：在手术前一定时间内，要让宠物禁食，以避免手术中呕吐或误吸等情况的发生。具体的禁食时间要根据宠物的品种和年龄而定，一般为8-12小时。"
                ],
                image: require("@/assets/role/roleDetail/麻醉准备.jpg"),
                video: require("@/assets/role/roleDetail/宠物麻醉.mp4")
            },
            {
                title: "开始麻醉",
                desc: [
                    "选择麻醉药物：根据手术的类型、宠物的体重和健康状况等因素，选择适合的麻醉药物。一般来说，全身麻醉可以采用静脉麻醉或气管插管麻醉，局部麻醉可以采用局部麻醉剂。",
                    "给药：根据宠物的体重和需要麻醉的深度，按照医生的建议给药。全身麻醉需要将麻醉剂注射到静脉中或通过气管插管进行吸入，局部麻醉需要将麻醉剂注射到局部组织中。"
                ],
                image: require("@/assets/role/roleDetail/开始麻醉.jpg")
            },
            {
                title: "麻醉监测完善",
                desc: [
                    "监测：在麻醉过程中，需要对宠物进行监测，包括心率、呼吸、血压等指标的监测，以及对宠物的体温和麻醉深度进行监测。一旦发现异常情况，需要及时采取措施。",
                    "麻醉苏醒：手术结束后，需要对宠物进行观察和护理，直到宠物完全恢复清醒。在此期间，需要注意宠物的体温、呼吸、心率等指标的变化，以及宠物的饮食和排泄情况。"
                ],
                image: require("@/assets/role/roleDetail/麻醉监测.jpg")
            }
        ],
        "器械准备": [
            {
                title: "器械清洗消毒",
                desc: [
                    "在进行手术和检查之前，需要准备各种器械，例如手术刀、缝合针、手术灯等。",
                    "这些器械需要经过清洗和消毒，以确保宠物不会感染。"
                ],
                image: require("@/assets/role/roleDetail/器械清洗消毒.jpg"),
                video: require("@/assets/role/roleDetail/器械准备.mp4")
            },
            {
                title: "器械检查",
                desc: [
                    "安排器械：在医院的手术室中，需要将各种器械按照需要进行安排和准备，例如放置手术刀、缝合针、止血夹等。",
                    "检查器械的完整性：在进行手术之前，需要检查各种器械的完整性和清洁度，确保它们没有损坏或受到污染。"
                ],
                image: require("@/assets/role/roleDetail/器械检查.jpg")
            },
            {
                title: "器械的后续维护",
                desc: [
                    "标记和分类器械：对于不同类型的手术和检查，需要标记和分类器械，以便医生和护士可以快速找到需要的器械。",
                    "定期检查器械：为确保器械在长时间使用后仍然能够正常工作，医院需要定期检查器械的状态，包括刀片的锋利度、电动设备的电池寿命等等。",
                    "记录器械的使用和维护情况：为了保证医院各种器械的正常运作和安全性，需要记录每一件器械的使用和维护情况"
                ],
                image: require("@/assets/role/roleDetail/器械的后续维护.jpg")

            }
        ]
    },
    "shouyi": {},
    "qiantai": {}
}