export const roles = {
    "yizhu":{
        knowledge:{
            "注射工作": {
                "静脉注射": [
                    {
                        image: "", // 该步骤的示例图
                        tools: [], // 进行这一步操作所需要的工具
                        title: "准备药液", // 该步骤的总体描述信息
                        desc: [
                            "铺无菌盘，核对注射单与医嘱，按医嘱准备药液，并严格查对；",
                            "将安瓿尖端的药液弹至体部，用75%乙醇棉签消毒颈部及砂轮后，在安瓿颈部划一锯痕，重新消毒，取无菌纱布拭去细屑，折断安瓿；",
                            "检查一次性注射器后打开，接针头、试通畅，抽吸药液，套上针头套放于无菌盘内，空安瓿置于空针旁"
                        ], //描述信息
                        tips: "", //注意事项
                    },
                    {
                        image: "",
                        tools: [],
                        title: "选取注射部位",
                        desc:[
                            "推车携用物至床旁，核对患者床号、姓名，说明，解释以取得合作；",
                            "协助患者取舒适卧位，在穿刺部位下垫治疗巾，扎止血带，选血管，松止血带；",
                            "用0.5%碘伏消毒2 次（或2%碘酊消毒1 次， 75%乙醇棉签脱碘2 次），消毒直径＞125px；",
                            "在穿刺点上方5-175px 处扎止血带，嘱其握拳；"
                        ],
                        tips: ""
                    },
                    {
                        image: "",
                        tools: [],
                        title: "穿刺",
                        desc:[
                            "再次核对药名、剂量、浓度、时间、用法，排尽注射器内空气；",
                            "左手拇指绷紧静脉下端皮肤，针头斜面向上与皮肤呈15-30°角自静脉上方或侧方刺入皮下，再沿静脉方向滑行刺入静脉，见回血，再进针少许；",
                            "松开止血带，嘱患者松拳，固定针栓（如为头皮针，应用胶布固定针柄）；"
                        ],
                        tips: ""
                    },
                    {
                        image: "",
                        tools: [],
                        title: "注射",
                        desc:[
                            "缓慢注入药液（操作过程中密切观察患者，及时沟通转移患者注意力）；",
                            "注射毕，将无菌棉签置于穿刺点上方，迅速拔针，按压片刻或嘱患者屈肘至不出血为止；",
                            "再次核对，观察用药后反应"
                        ],
                        tips: ""
                    },
                    {
                        image: "",
                        tools: [],
                        title: "术后完善工作",
                        desc:[
                            "整理床单位，协助患者取舒适卧位，向患者解释注意事项，告知患者有可能发生的不良反应，如有不适及时告诉医护人员，感谢患者的配合；",
                            "分类清理用物，初步消毒处理、洗手、记录。"
                        ],
                        tips: ""
                    }
                ],
                "皮下注射": [],
                "肌肉注射": [],
                "局部封闭注射": []
            },
            "术前准备工作": {
                "麻醉准备": [],
                "器械准备": [],
                "服装准备": []
            }
        }
    },
    "shouyi": {
        knowledge: {
            "手术流程": []
        }
    },
    "qiantai": {}
}